{
    "info": [
        "il y a environ 160 000 espèces de papillons, dont la grande majorité fait partie des papillons de nuit (Heterocera). Les papillons de jour (Rhopalocera), comme les monarques ou les papillons azurés, représentent une petite fraction de ce total, avec environ 17 500 espèces.",
        "Les papillons ont un goût... au bout de leurs pieds ! En effet, leurs récepteurs gustatifs se trouvent sur leurs pattes, leur permettant de \"goûter\" les plantes sur lesquelles ils se posent, pour vérifier si elles sont adaptées à la ponte de leurs œufs.<br />C’est une manière unique et fascinante de percevoir leur environnement !",
        "Certains papillons, comme le monarque, parcourent des milliers de kilomètres lors de leur migration annuelle. Ils voyagent jusqu'à 4 800 km entre l'Amérique du Nord et le Mexique.",
        "Les ailes des papillons sont recouvertes de minuscules écailles qui leur donnent leurs couleurs et motifs. Ces écailles peuvent aussi jouer un rôle dans la régulation de la température corporelle.",
        "Les papillons peuvent voir des couleurs invisibles pour l'œil humain, comme l'ultraviolet, grâce à des récepteurs spéciaux sur leurs yeux.",
        "Certains papillons ne mangent pas pendant leur vie adulte, car ils se nourrissent exclusivement durant leur phase de chenille avant de se transformer en imago.",
        "La durée de vie d'un papillon adulte peut varier de quelques jours à plusieurs mois, selon les espèces.",
        "Les papillons ont une mémoire étonnante et peuvent se souvenir de certaines odeurs pendant plusieurs jours, ce qui les aide à trouver des sources de nectar.",
        "Certaines espèces de papillons ont des ailes transparentes, comme le papillon \"Glasswing\" (Greta oto), dont les ailes sont presque invisibles.",
        "Les papillons migrateurs, comme le monarque, naviguent grâce aux champs magnétiques de la Terre et peuvent retrouver le même endroit chaque année, même après avoir parcouru des milliers de kilomètres.",
        "Les chenilles des papillons se transforment en chrysalides pour se métamorphoser. Durant cette phase, elles subissent de profonds changements physiques avant de devenir des papillons adultes.",
        "Les papillons peuvent être des indicateurs de la santé environnementale, car ils sont sensibles aux changements dans leur habitat, notamment à la pollution et à la perte de biodiversité."
    ]
}